reports/performance/spike_test_summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: performance/spike_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 50s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/30 VUs  01.0s/50.0s

running (0m02.0s), 01/30 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 01/30 VUs  02.0s/50.0s

running (0m03.0s), 02/30 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 02/30 VUs  03.0s/50.0s

running (0m04.0s), 02/30 VUs, 4 complete and 0 interrupted iterations
default   [   8% ] 02/30 VUs  04.0s/50.0s

running (0m05.0s), 02/30 VUs, 6 complete and 0 interrupted iterations
default   [  10% ] 02/30 VUs  05.0s/50.0s

running (0m06.0s), 03/30 VUs, 8 complete and 0 interrupted iterations
default   [  12% ] 03/30 VUs  06.0s/50.0s

running (0m07.0s), 03/30 VUs, 11 complete and 0 interrupted iterations
default   [  14% ] 03/30 VUs  07.0s/50.0s

running (0m08.0s), 04/30 VUs, 14 complete and 0 interrupted iterations
default   [  16% ] 04/30 VUs  08.0s/50.0s

running (0m09.0s), 04/30 VUs, 18 complete and 0 interrupted iterations
default   [  18% ] 04/30 VUs  09.0s/50.0s

running (0m10.0s), 04/30 VUs, 22 complete and 0 interrupted iterations
default   [  20% ] 04/30 VUs  10.0s/50.0s

running (0m11.0s), 07/30 VUs, 26 complete and 0 interrupted iterations
default   [  22% ] 07/30 VUs  11.0s/50.0s

running (0m11.8s), 09/30 VUs, 33 complete and 0 interrupted iterations
default   [  24% ] 09/30 VUs  11.8s/50.0s

running (0m12.0s), 09/30 VUs, 33 complete and 0 interrupted iterations
default   [  24% ] 09/30 VUs  12.0s/50.0s

running (0m13.0s), 12/30 VUs, 42 complete and 0 interrupted iterations
default   [  26% ] 12/30 VUs  13.0s/50.0s

running (0m14.0s), 14/30 VUs, 54 complete and 0 interrupted iterations
default   [  28% ] 14/30 VUs  14.0s/50.0s

running (0m15.0s), 17/30 VUs, 68 complete and 0 interrupted iterations
default   [  30% ] 17/30 VUs  15.0s/50.0s

running (0m16.0s), 19/30 VUs, 85 complete and 0 interrupted iterations
default   [  32% ] 19/30 VUs  16.0s/50.0s

running (0m17.0s), 22/30 VUs, 104 complete and 0 interrupted iterations
default   [  34% ] 22/30 VUs  17.0s/50.0s

running (0m18.0s), 24/30 VUs, 126 complete and 0 interrupted iterations
default   [  36% ] 24/30 VUs  18.0s/50.0s

running (0m19.0s), 27/30 VUs, 150 complete and 0 interrupted iterations
default   [  38% ] 27/30 VUs  19.0s/50.0s

running (0m20.0s), 29/30 VUs, 177 complete and 0 interrupted iterations
default   [  40% ] 29/30 VUs  20.0s/50.0s

running (0m21.0s), 30/30 VUs, 206 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  21.0s/50.0s

running (0m22.0s), 30/30 VUs, 236 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  22.0s/50.0s

running (0m23.0s), 30/30 VUs, 266 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  23.0s/50.0s

running (0m24.0s), 30/30 VUs, 296 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  24.0s/50.0s

running (0m25.0s), 30/30 VUs, 326 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  25.0s/50.0s

running (0m26.0s), 30/30 VUs, 356 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  26.0s/50.0s

running (0m27.0s), 30/30 VUs, 386 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  27.0s/50.0s

running (0m28.0s), 30/30 VUs, 416 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  28.0s/50.0s

running (0m29.0s), 30/30 VUs, 444 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  29.0s/50.0s

running (0m30.0s), 30/30 VUs, 472 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  30.0s/50.0s

running (0m31.0s), 30/30 VUs, 502 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  31.0s/50.0s

running (0m32.0s), 30/30 VUs, 532 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  32.0s/50.0s

running (0m33.0s), 30/30 VUs, 562 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  33.0s/50.0s

running (0m34.0s), 30/30 VUs, 592 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  34.0s/50.0s

running (0m35.0s), 30/30 VUs, 622 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  35.0s/50.0s

running (0m36.0s), 30/30 VUs, 651 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  36.0s/50.0s

running (0m37.0s), 30/30 VUs, 681 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  37.0s/50.0s

running (0m38.0s), 30/30 VUs, 711 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  38.0s/50.0s

running (0m39.0s), 30/30 VUs, 741 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  39.0s/50.0s

running (0m40.0s), 30/30 VUs, 771 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  40.0s/50.0s

running (0m41.0s), 29/30 VUs, 800 complete and 0 interrupted iterations
default   [  82% ] 29/30 VUs  41.0s/50.0s

running (0m42.0s), 27/30 VUs, 827 complete and 0 interrupted iterations
default   [  84% ] 27/30 VUs  42.0s/50.0s

running (0m43.0s), 24/30 VUs, 854 complete and 0 interrupted iterations
default   [  86% ] 24/30 VUs  43.0s/50.0s

running (0m44.0s), 20/30 VUs, 876 complete and 0 interrupted iterations
default   [  88% ] 20/30 VUs  44.0s/50.0s

running (0m45.0s), 17/30 VUs, 896 complete and 0 interrupted iterations
default   [  90% ] 17/30 VUs  45.0s/50.0s

running (0m46.0s), 14/30 VUs, 912 complete and 0 interrupted iterations
default   [  92% ] 14/30 VUs  46.0s/50.0s

running (0m47.0s), 11/30 VUs, 926 complete and 0 interrupted iterations
default   [  94% ] 11/30 VUs  47.0s/50.0s

running (0m48.0s), 08/30 VUs, 937 complete and 0 interrupted iterations
default   [  96% ] 08/30 VUs  48.0s/50.0s

running (0m49.0s), 05/30 VUs, 945 complete and 0 interrupted iterations
default   [  98% ] 05/30 VUs  49.0s/50.0s

running (0m50.0s), 02/30 VUs, 950 complete and 0 interrupted iterations
default   [ 100% ] 02/30 VUs  50.0s/50.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1200' p(95)=9.11ms

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2856    56.595649/s
    checks_succeeded...: 100.00% 2856 out of 2856
    checks_failed......: 0.00%   0 out of 2856

    ✓ home page status is 200
    ✓ login page status is 200
    ✓ register page status is 200

    HTTP
    http_req_duration..............: avg=3.98ms min=519µs med=3.29ms p(90)=7.64ms p(95)=9.11ms p(99)=11.98ms max=42.84ms
      { expected_response:true }...: avg=3.98ms min=519µs med=3.29ms p(90)=7.64ms p(95)=9.11ms p(99)=11.98ms max=42.84ms
    http_req_failed................: 0.00%  0 out of 2856
    http_reqs......................: 2856   56.595649/s

    EXECUTION
    iteration_duration.............: avg=1.01s  min=1s    med=1.01s  p(90)=1.02s  p(95)=1.02s  p(99)=1.02s   max=1.04s  
    iterations.....................: 952    18.865216/s
    vus............................: 2      min=1         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 11 MB  218 kB/s
    data_sent......................: 281 kB 5.6 kB/s



running (0m50.5s), 00/30 VUs, 952 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  50s